       IDENTIFICATION DIVISION.
       PROGRAM-ID.    DYNAMICLENGTH.

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 VAR-D PIC X DYNAMIC LENGTH LIMIT 10.

       PROCEDURE DIVISION.
           MOVE "Hello" TO VAR-D
           DISPLAY "VAR-D = " VAR-D "/LENGTH = " LENGTH OF VAR-D.

           GOBACK.