       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       AUTHOR. JEDURAND.

       PROCEDURE DIVISION.
           DISPLAY "Hello, GnuCOBOL!".
           STOP RUN.
