IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAMME-DB2.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
EXEC SQL INCLUDE SQLCA END-EXEC.
01 WS-NOM-CLIENT PIC X(50).
01 WS-NUMERO-CLIENT PIC 9(5).

PROCEDURE DIVISION.
    DISPLAY "Connexion à la base de données".
    EXEC SQL
        CONNECT TO 'DB-NOM' USER 'UTILISATEUR' USING 'MOTDEPASSE'
    END-EXEC.
    IF SQLCODE NOT = 0
        DISPLAY "Erreur de connexion : " SQLCODE
        STOP RUN.
    END-IF.

    DISPLAY "Entrez le numéro du client : ".
    ACCEPT WS-NUMERO-CLIENT.

    EXEC SQL
        SELECT NOM_CLIENT
        INTO :WS-NOM-CLIENT
        FROM CLIENTS
        WHERE NUMERO_CLIENT = :WS-NUMERO-CLIENT
    END-EXEC.
    IF SQLCODE = 0
        DISPLAY "Nom du client : " WS-NOM-CLIENT
    ELSE
        DISPLAY "Erreur SQL : " SQLCODE
    END-IF.

    EXEC SQL
        COMMIT
    END-EXEC.

    EXEC SQL
        DISCONNECT CURRENT
    END-EXEC.

    STOP RUN.