PERFORM TRY
    EXEC SQL
        OPEN CURSOR_CLIENT
    END-EXEC.

    PERFORM UNTIL SQLCODE = 100
        EXEC SQL
            FETCH CURSOR_CLIENT
            INTO :WS-ID-CLIENT, :WS-NOM-CLIENT, :WS-EMAIL-CLIENT
        END-EXEC.
    END-PERFORM.
FINALLY
    EXEC SQL
        CLOSE CURSOR_CLIENT
    END-EXEC.
END-TRY.