       IDENTIFICATION DIVISION.
       PROGRAM-ID. acronym.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 WS-ACRONYM               PIC X(80).
       01 WS-RESULT                PIC X(20).
       01 WS-MID                   PIC X.
       01 WS-POINTEUR              PIC 9(3).
       01 WS-LENGTH                PIC 9(3).

       PROCEDURE DIVISION.
       ABBREVIATE.
       INITIALIZE WS-RESULT, WS-MID, WS-POINTEUR, WS-LENGTH
       MOVE FUNCTION LENGTH(FUNCTION TRIM(WS-ACRONYM)) TO WS-LENGTH
       PERFORM UNTIL WS-POINTEUR >= WS-LENGTH
         UNSTRING WS-ACRONYM DELIMITED BY SPACE OR '-'
            INTO WS-MID
            WITH POINTER WS-POINTEUR
         END-UNSTRING
         STRING WS-RESULT, WS-MID
            INTO WS-RESULT
         END-STRING
       END-PERFORM.
