       IDENTIFICATION DIVISION.
       PROGRAM-ID. acronym.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 WS-ACRONYM               PIC X(80).
       01 WS-RESULT                PIC X(20).
       01 WS-MID                   PIC X(100).
       01 WS-POINTEUR              PIC 9(3).

       PROCEDURE DIVISION.
       ABBREVIATE.
       INITIALIZE WS-RESULT, WS-MID, WS-POINTEUR
       PERFORM UNTIL 1 = 0
         UNSTRING WS-ACRONYM DELIMITED BY SPACE OR '-'
            INTO WS-MID
            WITH POINTER WS-POINTEUR
            ON OVERFLOW EXIT PERFORM
         END-UNSTRING
         STRING FUNCTION TRIM(WS-RESULT), FUNCTION TRIM(WS-MID)
            INTO WS-RESULT
         END-STRING
       END-PERFORM.
