       IDENTIFICATION DIVISION.
       PROGRAM-ID. armstrong-numbers.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY. FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUMBER.
         05 WS-NUM PIC X OCCURS 8 TIMES.
       01 WS-ARMSTRONG PIC 9(8).
       01 WS-RESULT PIC 9.
       01 WS-I PIC 9.
       01 WS-LENGTH PIC 9.
       PROCEDURE DIVISION.
       MAIN.
         MOVE 9474 TO WS-NUMBER
         PERFORM ARMSTRONG-NUMBERS
         DISPLAY WS-RESULT
         STOP RUN.
       CALC.
         COMPUTE WS-ARMSTRONG = WS-ARMSTRONG + FUNCTION NUMVAL ( 
            WS-NUM( 8 - WS-I ) ) ** WS-LENGTH
         ADD 1 TO WS-I.
       ARMSTRONG-NUMBERS.
         MOVE ZERO TO WS-ARMSTRONG WS-I WS-RESULT
         COMPUTE WS-LENGTH = FUNCTION LENGTH ( TRIM ( WS-NUMBER ) )
         PERFORM CALC UNTIL WS-I > 8
         IF FUNCTION NUMVAL ( WS-NUMBER ) EQUALS WS-ARMSTRONG
           MOVE 1 TO WS-RESULT WS-ARMSTRONG.
