       IDENTIFICATION DIVISION.
       PROGRAM-ID. difference-of-squares.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DIFFERENCE-OF-SQUARES PIC 9(8).
       01 WS-SUM-OF-SQUARES PIC 9(8).
       01 WS-SQUARE-OF-SUM PIC 9(8).
       01 WS-NUMBER PIC 9(8).
       01 WS-I PIC 9(8) VALUE 1.


       PROCEDURE DIVISION.

       MAIN.
      	MOVE 100 TO WS-NUMBER
      	PERFORM SQUARE-OF-SUM
         DISPLAY WS-SQUARE-OF-SUM
      	PERFORM SUM-OF-SQUARES
         DISPLAY WS-SUM-OF-SQUARES
      	PERFORM DIFFERENCE-OF-SQUARES
      	DISPLAY WS-DIFFERENCE-OF-SQUARES
         STOP RUN.
       
       SQUARE-OF-SUM.
         MOVE 0 TO WS-SQUARE-OF-SUM
         MOVE 1 TO WS-I

         PERFORM UNTIL WS-I > WS-NUMBER
            COMPUTE WS-SQUARE-OF-SUM = WS-SQUARE-OF-SUM + WS-I
            ADD 1 TO WS-I
         END-PERFORM

         COMPUTE WS-SQUARE-OF-SUM = WS-SQUARE-OF-SUM ** 2
         .
       
       SUM-OF-SQUARES.
         MOVE 0 TO WS-SUM-OF-SQUARES
         MOVE 1 TO WS-I

         PERFORM UNTIL WS-I > WS-NUMBER
            COMPUTE WS-SUM-OF-SQUARES = WS-SUM-OF-SQUARES + (WS-I ** 2)
            ADD 1 TO WS-I
         END-PERFORM
         .

       
       DIFFERENCE-OF-SQUARES.
         MOVE 0 TO WS-DIFFERENCE-OF-SQUARES
         COMPUTE WS-DIFFERENCE-OF-SQUARES =
            WS-SQUARE-OF-SUM - WS-SUM-OF-SQUARES
         .