IDENTIFICATION DIVISION.
PROGRAM-ID. ExempleRuptureControle.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT FICHIER-TRANSACTIONS ASSIGN TO TRANSACTIONS-DD.

DATA DIVISION.
FILE SECTION.
FD FICHIER-TRANSACTIONS.
01 ENREGISTREMENT-TRANSACTION.
    05 ID-DEPT PIC X(05).
    05 MONTANT PIC 9(07).

WORKING-STORAGE SECTION.
01 ID-DEPT-PRECEDENT PIC X(05) VALUE SPACES.
01 TOTAL-DEPT PIC 9(07) VALUE ZERO.

PROCEDURE DIVISION.
LIRE-FICHIER.
    OPEN INPUT FICHIER-TRANSACTIONS
    READ FICHIER-TRANSACTIONS INTO ENREGISTREMENT-TRANSACTION
    PERFORM UNTIL END-OF-FILE
       IF ID-DEPT-PRECEDENT NOT = ID-DEPT
          PERFORM TRAITER-RUPTURE
          MOVE ID-DEPT TO ID-DEPT-PRECEDENT
       END-IF
    ADD MONTANT TO TOTAL-DEPT
    READ FICHIER-TRANSACTIONS INTO ENREGISTREMENT-TRANSACTION
    END-PERFORM
    CLOSE FICHIER-TRANSACTIONS
    STOP RUN.

TRAITER-RUPTURE.
    IF ID-DEPT-PRECEDENT NOT = SPACES
       DISPLAY "Total pour le département ", ID-DEPT-PRECEDENT, ": ", TOTAL-DEPT
    END-IF
    MOVE ZERO TO TOTAL-DEPT.
